In [1]:
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

what you need to learn
- loading data
- selection 
    - rows
    - columns
- manipulation
    - add columns
    - remove columns
    - rename columns
    - change data type
    - delete data
    - remove duplicates
    - sort
    - group by
    - pivot
    - merge
- visualisation
    - line plot
    - bar plot
    - histogram
    - box plot
    - scatter plot
    - heatmap
    - pie chart
    - word cloud

In [2]:
penguins=sns.load_dataset('penguins')
penguins

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

- analysis
    - univariate analysis
    - bi variate analysis
    - multivariate analysis

- loading data
    - excel file
    - custom data in a varaible
    - csv/json/etc
    - database(sql)

In [33]:
student={
    'Name':['vaibhav','siya','aman','amjad','sneha','aditi','bhupendra'],
    'College':['srmcem','srmcem','kmc','kmc','cu','srmcem','srmcem'],
    'DOB':['25jan','2 feb','2 apr','16 aug','16 sep','17 dec','22 may']
}

sdf=pd.DataFrame(student)
sdf

        Name College     DOB
0    vaibhav  srmcem   25jan
1       siya  srmcem   2 feb
2       aman     kmc   2 apr
3      amjad     kmc  16 aug
4      sneha      cu  16 sep
5      aditi  srmcem  17 dec
6  bhupendra  srmcem  22 may

In [10]:
data=pd.read_excel('C:/Users/pc/OneDrive/Desktop/Book1.xlsx')
data

     item  qty  amount
0   apple   10     250
1  banana   25     650
2  cherry  100     500

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   item    3 non-null      object
 1   qty     3 non-null      int64
 2   amount  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [13]:
data.columns.tolist()

['item', 'qty', 'amount']

In [14]:
data['item']        #column selection as dictionary key

0     apple
1    banana
2    cherry
Name: item, dtype: object

In [16]:
data.amount       #single columns   #column selection as object attribute

0    250
1    650
2    500
Name: amount, dtype: int64

In [17]:
#syntax to select two columns 
#data[column list]
data[['item','qty']]

     item  qty
0   apple   10
1  banana   25
2  cherry  100

oprn btween column(numeric)

adding columns

In [19]:
data['total']=data['amount']*data['qty']

In [20]:
data

     item  qty  amount  total
0   apple   10     250   2500
1  banana   25     650  16250
2  cherry  100     500  50000

In [22]:
data['new']='some crap'
data

     item  qty  amount  total        new
0   apple   10     250   2500  some crap
1  banana   25     650  16250  some crap
2  cherry  100     500  50000  some crap

removing columns

In [25]:
data.drop(columns=['new'],inplace=True)
data

     item  qty  amount  total
0   apple   10     250   2500
1  banana   25     650  16250
2  cherry  100     500  50000

In [26]:
data.iloc[0] #index lock

item      apple
qty          10
amount      250
total      2500
Name: 0, dtype: object

In [28]:
data.iloc[:2]

     item  qty  amount  total
0   apple   10     250   2500
1  banana   25     650  16250

In [30]:
data.drop(index=[0,2])

     item  qty  amount  total
1  banana   25     650  16250

In [31]:
data

     item  qty  amount  total
0   apple   10     250   2500
1  banana   25     650  16250
2  cherry  100     500  50000

In [34]:
sdf

        Name College     DOB
0    vaibhav  srmcem   25jan
1       siya  srmcem   2 feb
2       aman     kmc   2 apr
3      amjad     kmc  16 aug
4      sneha      cu  16 sep
5      aditi  srmcem  17 dec
6  bhupendra  srmcem  22 may

In [40]:
sdf.drop(index=[5,6])

      Name College     DOB
0  vaibhav  srmcem   25jan
1     siya  srmcem   2 feb
2     aman     kmc   2 apr
3    amjad     kmc  16 aug
4    sneha      cu  16 sep

In [41]:
data['qty']-1

0     9
1    24
2    99
Name: qty, dtype: int64

In [42]:
data['qty']=data['qty']-1

In [46]:
#rename
data.rename(
    mapper={'item':'product'},axis=1,inplace=True
)
data

  product  qty  amount  total
0   apple    9     250   2500
1  banana   24     650  16250
2  cherry   99     500  50000